performance.yml
config:
  payload:
    path: "NewsCorp.csv"
    fields:
      - "idPanel"
      - "source"
      - "date"
    # order: sequence
  target: "https://content.capi-nonprod.newscorp.com"
  phases:
    - duration: 1
      arrivalRate: 700
      name: "Stress"
    - duration: 1
      arrivalRate: 1500
      name: "Load"
  defaults:
   headers:
      x-api-key: ${APIKEYDEV}
scenarios:
  - flow:
      - post:
          url: "/ingest/processors/GSHOWCASE"
          json:
            id: "{{ idPanel }}-{{ source }}"
            createdDate: "2021-03-02T15:00:09.000Z"    
            updatedDate: "2021-03-02T15:00:09.000Z"
            publisher: "thetimes"
            content: "<entry><id>https://www.{{ source }}.co.uk/money/15395677/single-first-time-home-buyer-tips/?id={{ idPanel }}</id><published>{{ date }}</published><updated>{{ date }}</updated><g:panel type=\"SINGLE_STORY\">https://www.{{ source }}.co.uk/money/15395677/single-first-time-home-buyer-tips/?id={{ idPanel }}</g:panel><g:panel_title>Artillery Test</g:panel_title><g:overline>Six things yo</g:overline><title>Six things you need to know if you're a single first-time home buyer</title><author><name>. , : ; ‘ – – _ @ ‘ ‘ \" \" / \\ {{ idPanel }}-{{ source }} </name></author><link href=\"https://www.{{ source }}.co.uk/money/15395677/single-first-time-home-buyer-tips/?id={{ idPanel }}\"/><media:content url=\"https://content.capi-stage.newscorp.com/images/77cdfd73bcba8a969accb6ac12cf2856?combo2to1=1200\"></media:content><g:bullet_list><g:list_item>Emmerdale spoilers LIVE: Shock affair for David &amp; Victoria plus EastEnders &amp; Coronation Street latest updates</g:list_item><g:list_item>Bullet 2 Bullet 2 {{ idPanel }}-{{ source }} </g:list_item><g:list_item>Bullet 1 Bullet 1 {{ idPanel }}-{{ source }} </g:list_item></g:bullet_list></entry>"
            user: "vekaerre@gmail.com"
            domain: "http://news-showcase-develop.showcase.newspress.app"   
      - get:
           url: "/content/articles/complete/GSHOWCASE/{{ idPanel }}-{{ source }}"  
      - log: "{{ idPanel }}-{{ source }}"






# For more information: https://artillery.io/docs/script-reference/